{
  "activation": "gelu",
  "architectures": [
    "DistilBertForMaskedLM"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "<PAD_LABEL>",
    "1": "O",
    "2": "B-Name",
    "3": "I-Name",
    "4": "B-Designation",
    "5": "I-Designation",
    "6": "B-Companies worked at",
    "7": "I-Companies worked at",
    "8": "B-Location",
    "9": "I-Location",
    "10": "B-Email Address",
    "11": "I-Email Address",
    "12": "B-College Name",
    "13": "I-College Name",
    "14": "B-Degree",
    "15": "I-Degree",
    "16": "B-Graduation Year",
    "17": "I-Graduation Year",
    "18": "B-Skills",
    "19": "I-Skills",
    "20": "B-Years of Experience",
    "21": "I-Years of Experience"
  },
  "initializer_range": 0.02,
  "label2id": {
    "<PAD_LABEL>": 0,
    "B-College Name": 12,
    "B-Companies worked at": 6,
    "B-Degree": 14,
    "B-Designation": 4,
    "B-Email Address": 10,
    "B-Graduation Year": 16,
    "B-Location": 8,
    "B-Name": 2,
    "B-Skills": 18,
    "B-Years of Experience": 20,
    "I-College Name": 13,
    "I-Companies worked at": 7,
    "I-Degree": 15,
    "I-Designation": 5,
    "I-Email Address": 11,
    "I-Graduation Year": 17,
    "I-Location": 9,
    "I-Name": 3,
    "I-Skills": 19,
    "I-Years of Experience": 21,
    "O": 1
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.6.2",
  "vocab_size": 30522
}
