{
  "add_cross_attention": false,
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "<PAD_LABEL>",
    "1": "O",
    "2": "B-Name",
    "3": "I-Name",
    "4": "B-Designation",
    "5": "I-Designation",
    "6": "B-Companies worked at",
    "7": "I-Companies worked at",
    "8": "B-Location",
    "9": "I-Location",
    "10": "B-Email Address",
    "11": "I-Email Address",
    "12": "B-College Name",
    "13": "I-College Name",
    "14": "B-Degree",
    "15": "I-Degree",
    "16": "B-Graduation Year",
    "17": "I-Graduation Year",
    "18": "B-Skills",
    "19": "I-Skills",
    "20": "B-Years of Experience",
    "21": "I-Years of Experience"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "<PAD_LABEL>": 0,
    "B-College Name": 12,
    "B-Companies worked at": 6,
    "B-Degree": 14,
    "B-Designation": 4,
    "B-Email Address": 10,
    "B-Graduation Year": 16,
    "B-Location": 8,
    "B-Name": 2,
    "B-Skills": 18,
    "B-Years of Experience": 20,
    "I-College Name": 13,
    "I-Companies worked at": 7,
    "I-Degree": 15,
    "I-Designation": 5,
    "I-Email Address": 11,
    "I-Graduation Year": 17,
    "I-Location": 9,
    "I-Name": 3,
    "I-Skills": 19,
    "I-Years of Experience": 21,
    "O": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "transformers_version": "5.6.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
